renesas/amazon-freertos/lib/ota/portable/renesas/rx65n-rsk/aws_ota_pal.c
// flash bucket size
/* set "FLASH_CF_MIN_PGM_SIZE" or "FLASH_CF_MEDIUM_BLOCK_SIZE" */
#define FLASH_BUCKET_SIZE	 FLASH_CF_MEDIUM_BLOCK_SIZE

#if (FREAD_SIZE == 45U)
#define PARAM_DATA_LINE_NUM	35
#define DF_DATA_LINE_NUM	41
#define CF_DATA_LINE_NUM	45
#endif

#define BASE64_ENCODE_ONE_LINE_CHARACTER_LENGTH (24)
#define BASE64_ENCODE_EQUAL_CHARACTER_LENGTH (2)
#define BASE64_ENCODE_RETURN_CODE_LENGTH (2)
#define BASE64_ENCODE_CF_TOTAL_LENGTH (45)
#define BASE64_ENCODE_DF_TOTAL_LENGTH (41)
#define BASE64_ENCODE_SHA1_TOTAL_LENGTH (35)
#define BASE64_DECODE_TOTAL_LENGTH (16)
#define CODE_FLASH_WRITE_ERASE_SIZE (128)
#define CODE_FLASH_16BYTE_MASK (0x00000070u)
#define CODE_FLASH_128BYTE_ALIGN (0xffffff80u)
#define BOOT_LOADER_MIRROR_FIRST_ADDRESS FLASH_CF_BLOCK_37

typedef struct _load_firmware_control_block {
	uint32_t status;
	uint8_t file_name[256];
	uint32_t flash_buffer[FLASH_BUCKET_SIZE / 4];
	uint32_t offset;
	volatile uint32_t flash_write_in_progress_flag;
	volatile uint32_t flash_erase_in_progress_flag;
	uint32_t progress;
	uint8_t hash_sha1[SHA1_HASH_LENGTH_BYTE_SIZE];
	uint32_t firmware_length;
}LOAD_FIRMWARE_CONTROL_BLOCK;

typedef struct _firmware_update_control_block_sub
{
	uint32_t user_program_max_cnt;
	uint32_t lifecycle_state;
	uint8_t hash0_sha1[SHA1_HASH_LENGTH_BYTE_SIZE];
	uint8_t hash1_sha1[SHA1_HASH_LENGTH_BYTE_SIZE];
}FIRMWARE_UPDATE_CONTROL_BLOCK_SUB;

typedef struct _firmware_update_control_block
{
	FIRMWARE_UPDATE_CONTROL_BLOCK_SUB data;
	uint8_t hash_sha1[SHA1_HASH_LENGTH_BYTE_SIZE];
}FIRMWARE_UPDATE_CONTROL_BLOCK;

/******************************************************************************
 External variables
 ******************************************************************************/

/******************************************************************************
 Private global variables
 ******************************************************************************/
static uint32_t g_ram_vector_table[256];      // RAM space to hold the vector table
static LOAD_FIRMWARE_CONTROL_BLOCK load_firmware_control_block;
static FIRMWARE_UPDATE_CONTROL_BLOCK firmware_update_control_block_image = {0};

OTA_ImageState_t eSavedAgentState = eOTA_ImageState_Unknown;
#if (MY_BSP_CFG_OTA_ENABLE == 2)
SemaphoreHandle_t  OTASemaphoreHandle;
#endif /* MY_BSP_CFG_OTA_ENABLE == 2 */

/******************************************************************************
 External functions
 ******************************************************************************/
extern uint32_t base64_decode(uint8_t *source, uint8_t *result, uint32_t size);

/*******************************************************************************
 Private global variables and functions
********************************************************************************/
static int32_t firm_block_read(uint32_t *firmware, uint32_t offset);
static void dummy_int(void);
static void flash_load_firmware_callback_function(void *event);
static uint32_t *flash_copy_vector_table(void);

void bank_swap(void);
void ota_firmware_update_request(OTA_FileContext_t * const C);
bool is_firmupdating(void);
bool is_firmupdatewaitstart(void);

uint32_t load_firmware_process(void);
uint32_t get_update_data_size(void);
void flash_bank_swap_callback_function(void *event);
void load_firmware_status(uint32_t *now_status, uint32_t *finish_status);
void firmware_update_status_initialize(void);

int16_t file_write_process(uint8_t *buf, int16_t write_size, uint32_t Offset);
int16_t on_the_fly_write_process(uint8_t *buf, int16_t write_size, uint32_t Offset);

extern uint8_t     g_isFileWrite;

FIL file = {0};

uint32_t g_on_the_fly_start;

/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_CreateFileForRx( OTA_FileContext_t * const C )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_CreateFileForRx" );

    OTA_Err_t eResult = kOTA_Err_Uninitialized; /* For MISRA mandatory. */

	if( C != NULL )
	{
		/* No need for pacFilepath, we write directly to ROM instead of file system
		 * But still check for its existence because it is required by AWS */
		if ( C->pucFilePath != NULL )
		{
#if (MY_BSP_CFG_OTA_ENABLE == 1)
            FRESULT ret = TFAT_FR_OK;
            ret = R_tfat_f_open(&file, (const char *)C->pucFilePath, (TFAT_FA_OPEN_ALWAYS | TFAT_FA_READ | TFAT_FA_WRITE));
            if (TFAT_FR_OK == ret)
            {
				C->pucFile = (uint8_t *)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS;
				eResult = kOTA_Err_None;
				OTA_LOG_L1( "[%s] Firmware update initialized.\r\n", OTA_METHOD_NAME );
            }
            else
            {
				eResult = kOTA_Err_RxFileCreateFailed;
				OTA_LOG_L1( "[%s] ERROR - Failed to start operation: already active!\r\n", OTA_METHOD_NAME );
			}
#elif (MY_BSP_CFG_OTA_ENABLE == 2)
            C->pucFile = (uint8_t *)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS;
            vSemaphoreCreateBinary(OTASemaphoreHandle);
            if (OTASemaphoreHandle == NULL)
            {
                eResult = kOTA_Err_RxFileCreateFailed;
                OTA_LOG_L1( "[%s] ERROR - The semaphore was created fail.\r\n", OTA_METHOD_NAME );
            }
            // 最初にTEMPエリアのコードフラッシュを消去する。
            R_FLASH_Open();
            /* Transition to FIRMWARE_UPDATE_STATE_INITIALIZE state */
            firmware_update_status_initialize();
            /* 1st call, Transition to FIRMWARE_UPDATE_STATE_INITIALIZE state */
            ota_firmware_update_request(C);
            /* 2nd call, Transition to FIRMWARE_UPDATE_STATE_ERASE state
               Execute update firmware write area initialization */
            ota_firmware_update_request(C);
            /* Wait for flash erase to complete */
            while (FIRMWARE_UPDATE_STATE_ERASE_COMPLETE != load_firmware_control_block.status)
            {
                load_firmware_process();
                vTaskDelay(100);
            }
            eResult = kOTA_Err_None;
            OTA_LOG_L1( "[%s] Firmware update initialized.\r\n", OTA_METHOD_NAME );
            g_on_the_fly_start = 0;
#else
#endif
		}
		else
		{
			eResult = kOTA_Err_RxFileCreateFailed;
			OTA_LOG_L1( "[%s] ERROR - Invalid context provided.\r\n", OTA_METHOD_NAME );
		}
	}
	else
	{
		eResult = kOTA_Err_RxFileCreateFailed;
		OTA_LOG_L1( "[%s] ERROR - Invalid context provided.\r\n", OTA_METHOD_NAME );
	}

	return eResult;
}
/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_Abort( OTA_FileContext_t * const C )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_Abort" );
    
    OTA_LOG_L1("Function call: [%s].\r\n", OTA_METHOD_NAME);

