renesas/amazon-freertos/lib/ota/portable/renesas/rx65n-rsk/aws_ota_pal.c
void flash_load_firmware_callback_function(void *event)
{
	uint32_t event_code;
	event_code = *((uint32_t*)event);

	switch(event_code)
	{
		case FLASH_INT_EVENT_ERASE_COMPLETE:
#if (MY_BSP_CFG_OTA_ENABLE == 1)
			if(FIRMWARE_UPDATE_STATE_ERASE_WAIT_COMPLETE == load_firmware_control_block.status)
			{
				load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_READ_WAIT_COMPLETE;
			}
			else if(FIRMWARE_UPDATE_STATE_FINALIZE_WAIT_ERASE_DATA_FLASH == load_firmware_control_block.status)
			{
				R_FLASH_Write((uint32_t)&firmware_update_control_block_image, FLASH_DF_BLOCK_0, sizeof(FIRMWARE_UPDATE_CONTROL_BLOCK));
				load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_FINALIZE_WAIT_WRITE_DATA_FLASH;
			}
			else
			{
				load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERROR;
			}
#elif (MY_BSP_CFG_OTA_ENABLE == 2)
			if(FIRMWARE_UPDATE_STATE_ERASE_WAIT_COMPLETE == load_firmware_control_block.status)
			{
				load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERASE_COMPLETE;
			}
			else
			{
				load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERROR;
			}
#endif
			break;
		case FLASH_INT_EVENT_WRITE_COMPLETE:
#if (MY_BSP_CFG_OTA_ENABLE == 1)
			if(FIRMWARE_UPDATE_STATE_WRITE_WAIT_COMPLETE == load_firmware_control_block.status)
			{
				load_firmware_control_block.offset += FLASH_BUCKET_SIZE;
		    	load_firmware_control_block.progress = (uint32_t)(((float)(load_firmware_control_block.offset)/(float)((FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER))*100));

		    	if( load_firmware_control_block.firmware_length == load_firmware_control_block.offset )
				{
					load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_FINALIZE;
				}
				else
				{
					load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_READ_WAIT_COMPLETE;
				}
			}
			else if(FIRMWARE_UPDATE_STATE_FINALIZE_WAIT_WRITE_DATA_FLASH == load_firmware_control_block.status)
			{
				load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_FINALIZE_COMPLETED;
			}
			else
			{
				load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERROR;
			}
#elif (MY_BSP_CFG_OTA_ENABLE == 2)
			if(FIRMWARE_UPDATE_STATE_WRITE_WAIT_COMPLETE == load_firmware_control_block.status)
			{
                load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_WRITE_COMPLETE;
			}
			else
			{
				load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERROR;
			}
#endif
			break;
		case FLASH_INT_EVENT_TOGGLE_BANK:
	        R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
	        SYSTEM.SWRR = 0xa501;
			while(1);	/* software reset */
			break;
		default:
			nop();
			break;
	}
}


/******************************************************************************
Function Name   : file_write_sub
Description     : This function writes the file corresponding to the ID value
                  passed as an argument and advances the file pointer by the
                  amount write. The file pointer is recorded in the file
                  management information for each ID value and is maintained
                  until the file close function is called.
Arguments       : file_id -
                      ID value of the file to write
                  buf -
                      Storage area for the file data write
                  write_size -
                      Size of the file to write
Return Value    : (-1) -
                      Error
                  (0) -
                      Normal completion
******************************************************************************/
int16_t file_write_process(uint8_t *buf, int16_t write_size, uint32_t Offset)
{
    uint16_t 	file_size = 0;
    uint8_t     drvno = 0;
	FRESULT 	ret = TFAT_FR_OK;

    R_USB_HmscGetSem();
   	ret = R_tfat_f_lseek(&file, Offset);
    if (TFAT_FR_OK == ret)
    {
    	ret = R_tfat_f_write(&file, buf, (uint16_t)write_size, &file_size);
    	if (TFAT_FR_OK == ret)
    	{
            g_isFileWrite = USB_APL_YES;
        }
        else
        {
			g_isFileWrite = USB_APL_NO;
		}
		if ((uint16_t)write_size != file_size)
		{
			g_isFileWrite = USB_APL_NO;
		}
	}
	else
	{
        g_isFileWrite = USB_APL_NO;
    }
    R_USB_HmscRelSem();

    if (USB_APL_NO == g_isFileWrite)
    {
        return -1;
    }

    return 0;
}

/******************************************************************************
Function Name   : on_the_fly_write_process
Description     : 
Arguments       : 
Return Value    : 
******************************************************************************/
int16_t on_the_fly_write_process(uint8_t *buf, int16_t write_size, uint32_t Offset)
{
    uint32_t top_pointer = 0;
    uint32_t return_code_pointer = 0;
    uint32_t buffer_pointer = 0;
    uint32_t flash_address = 0;
    uint32_t block_size = 0;
    uint32_t index = 0; // 最初に書き込むコードフラッシュアドレスを決める

    uint8_t buf_tmp[BASE64_ENCODE_ONE_LINE_CHARACTER_LENGTH];
    uint8_t buf_code_flash[CODE_FLASH_WRITE_ERASE_SIZE] = {0};
    uint8_t* p_data = buf;

    xSemaphoreTake(OTASemaphoreHandle, portMAX_DELAY);

    while (write_size > block_size)
    {
        memset(buf_tmp, 0, sizeof(buf_tmp));

        // 1)bufの先頭から改行コードがくるまでポインタを進める。
        top_pointer = (uint32_t)p_data;
        return_code_pointer = (uint32_t)(strstr((char*)p_data, "\r\n"));
        buffer_pointer = return_code_pointer - top_pointer;

        // ①ポインタが"=="または"="の場合
        if (BASE64_ENCODE_EQUAL_CHARACTER_LENGTH >= buffer_pointer)
        {
            /* Do nothing */
        }
        // ②ポインタが"upprogram fff00000"の場合
        else if (BASE64_ENCODE_ONE_LINE_CHARACTER_LENGTH < buffer_pointer)
        {
            memcpy(buf_tmp, (p_data + buffer_pointer - BASE64_ENCODE_ONE_LINE_CHARACTER_LENGTH), BASE64_ENCODE_ONE_LINE_CHARACTER_LENGTH);
        }
        // ③ポインタが"LS0tLS1CRUdJTiBDRVJUSQ==\r\n"の場合
        else
        {
            uint32_t diff = 0;
            diff = BASE64_ENCODE_ONE_LINE_CHARACTER_LENGTH - buffer_pointer;
            if (0 != diff)
            {
                memset(buf_tmp, '/', diff);
                memcpy(&buf_tmp[diff], p_data, buffer_pointer);
            }
            else
            {
                memcpy(buf_tmp, p_data, buffer_pointer);
            }
        }

        // 2)ポインタから1行分 sscanf() でパースする。・・・2行目のパース
        //   最初に出てくるコードフラッシュのアドレス(2行目)情報を取得する
        uint8_t arg1[64] = {0};
        uint8_t arg2[64] = {0};
        uint8_t arg3[64] = {0};

        // 3)コードフラッシュ書込み用の128バイトRAM を用意する
        memset(buf_code_flash, 0xff, sizeof(buf_code_flash));

        sscanf((char*)(p_data + buffer_pointer + 1), "%64s %64s %64s", (char*)arg1, (char*)arg2, (char*)arg3);
        if (!strcmp((char *)arg1, "upprogram"))
        {
            sscanf((char*)arg2, "%x", &flash_address);

